tap "anomalyco/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Git-compatible distributed version control system
brew "jj"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Node.js JavaScript runtime
brew "node" if OS.mac?
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed if OS.mac?
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Install Stow to manage your dotfiles
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Parser generator tool
brew "tree-sitter-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# UI to create reproducible developer environments based on a devcontainer.json
cask "devpod" if OS.mac?
cask "font-fira-code" if OS.mac?
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty" if OS.mac?
# WebKit based web browser
cask "orion" if OS.mac?
# Multiplayer code editor
cask "zed@preview" if OS.mac?
